quantummongolia/industrial-iot/esp32_firmware/flowmeter/src/main.cpp
unsigned long lastReadTime = 0;      // Timestamp of last flow rate reading (ms)
unsigned long lastTotalizerReadTime = 0; // Сүүлд totalizer уншсан агшин (ms)
unsigned long lastWifiCheck = 0;     // Timestamp of last WiFi check (ms)
unsigned long lastHeapLogTime = 0;   // Сүүлд heap-н хэмжээг log хийсэн агшин
bool firebaseReady = false;          // Firebase auth complete flag

// Totalizer утга 1 минутад нэг л шинэчлэгдэх тул хооронд нь cache-д хадгална.
// Анхны утга 0.0 нь Firebase upload-д орохгүй — `cachedTotal*Valid` flag
// эхний амжилттай уншилтын дараа л true болж, шинэчлэлт эхэлнэ.
float cachedTotal1 = 0.0f, cachedTotal2 = 0.0f, cachedTotal3 = 0.0f;
bool  cachedTotal1Valid = false, cachedTotal2Valid = false, cachedTotal3Valid = false;

// Ultrasonic mount height (суурилуулалтын нийт өндөр, рег. 0x2009) — boot дээр
// нэг л удаа уншиж, Firebase-д нэг удаа нийтэлнэ. Дашбоард савны дээд хязгаарт
// (data-max) үүнийг ашиглана — HTML дээр гараар тохируулах шаардлагагүй.
float ulsMountM = 0.0f;
bool  ulsMountKnown = false;
bool  ulsMountSent = false;

// Firebase upload backoff — prevents auth rate-limit storms on failure
unsigned long fbNextAllowedAt = 0; // Next allowed upload timestamp
unsigned int fbFailStreak = 0;     // Consecutive upload failure count

// Modbus read failure recovery state
unsigned int consecutiveReadFails = 0; // Straight failed read cycles
unsigned int totalRecoveryAttempts = 0; // Recovery escalations since last success

// Connectivity watchdog state — салгагдсан агшнаас хэдий хугацаа өнгөрснийг хэмжинэ.
// 0 = одоо холбоотой (асуудалгүй).
unsigned long wifiDownSince = 0;    // WiFi салгагдсан агшин (ms)
unsigned long fbNotReadySince = 0;  // Firebase ready бус болсон агшин (ms, WiFi байгаа үед)

// ========================== WI-FI CONNECTION =========================

// WiFi event handler — auto-triggers reconnection on any disconnect event.
void onWifiEvent(WiFiEvent_t event) {
  switch (event) {
  case ARDUINO_EVENT_WIFI_STA_DISCONNECTED:
    Serial.println("[WiFi] Disconnected — attempting auto-reconnect");
    WiFi.reconnect();
    break;
  case ARDUINO_EVENT_WIFI_STA_GOT_IP:
    Serial.printf("[WiFi] Reconnected — IP: %s\n",
                  WiFi.localIP().toString().c_str());
    break;
  default:
    break;
  }
}

/*
 * Connect to WiFi network using credentials from secrets.h.
 * Skips if already connected. Waits up to 15 seconds for connection.
 * setAutoReconnect + WiFi event handler keep the link up automatically after
 * this initial connect, so loop-level polling is just a fallback.
 */
void wifiConnect() {
  if (WiFi.status() == WL_CONNECTED) // Skip if already connected
    return;

  Serial.printf("[WiFi] Connecting to network: %s", WIFI_SSID);
  WiFi.mode(WIFI_STA);         // Station mode
  WiFi.setAutoReconnect(true); // Auto reconnect on disconnect
  WiFi.persistent(true);       // Persist credentials to NVS
  WiFi.begin(WIFI_SSID, WIFI_PASSWORD);

  unsigned long start = millis();
  while (WiFi.status() != WL_CONNECTED && millis() - start < 15000) {
    delay(500);
    Serial.print(".");
  }

  if (WiFi.status() == WL_CONNECTED) {
    Serial.printf("\n[WiFi] Connected — IP: %s\n",
                  WiFi.localIP().toString().c_str());
  } else {
    Serial.println("\n[WiFi] Connection failed — will retry later");
    WiFi.disconnect(true); // Clear stale state so next begin() is clean
    delay(100);
    WiFi.begin(WIFI_SSID,
               WIFI_PASSWORD); // Kick off a fresh attempt in the background
  }
}

// ========================== FIREBASE INITIALIZATION
// ===============================

/*
 * Initialize Firebase connection with API key, database URL, and user
 * credentials. Uses email/password authentication method. Called once during
 * setup().
 */
void firebaseInit() {
  fbConfig.api_key = FIREBASE_API_KEY;     // Set Firebase project API key
  fbConfig.database_url = FIREBASE_DB_URL; // Set Firebase Realtime Database URL

  fbAuth.user.email = FIREBASE_USER_EMAIL;   // Set Firebase auth email
  fbAuth.user.password = FIREBASE_USER_PASS; // Set Firebase auth password

  fbConfig.token_status_callback =
      tokenStatusCallback; // Set callback for auth token status updates
  fbData.setBSSLBufferSize(
      2048, 2048); // Set SSL buffer size for secure communication

  Firebase.begin(&fbConfig,
                 &fbAuth);         // Initialize Firebase with config and auth
  Firebase.reconnectNetwork(true); // Enable automatic network reconnection

  Serial.println("[Firebase] Initialized — authenticating...");
}

// Exponential backoff: 2s → 4s → 8s → 16s → ... → 5min cap.
// Called after any Firebase.RTDB.set*() returns false.
void fbOnFailure() {
  fbFailStreak++;
  unsigned long backoff =
      2000UL * (1UL << min((unsigned int)8, fbFailStreak)); // 2s..~8min raw
  if (backoff > 300000UL)
    backoff = 300000UL; // cap at 5 min
  fbNextAllowedAt = millis() + backoff;
  Serial.printf("[Firebase] Backoff %lus (fail streak %u)\n", backoff / 1000,
                fbFailStreak);
}

void fbOnSuccess() {
  if (fbFailStreak > 0)
    Serial.println("[Firebase] Recovered");
  fbFailStreak = 0;
  fbNextAllowedAt = 0;
}

bool fbCanUpload() { return (long)(millis() - fbNextAllowedAt) >= 0; }

// ========================== DATA-LED LIVENESS FLIP =========================
// Сул зогссон сенсорын утга өөрчлөгдөхгүй бол Firebase-ийн .on("value")
// listener асдаггүй тул dashboard-ийн ногоон data-LED анивчдаггүй. Үүнийг
// засахын тулд утгыг 2 орноор бөөрөнхийлж, гацсан (өөрчлөгдөөгүй) тохиолдолд
// 3 дахь орныг 0↔1 сэлгэнэ — dashboard 2 орон харуулдаг тул flag үл харагдана,
// харин утга "өөрчлөгдсөн" болж LED анивчина. Уншилт амжилттай болоход л
// дуудагдана (okFlow/okLevel) — тиймээс үхсэн сенсор анивчихгүй, stale болно.
// ЗӨВХОН жижиг утганд (flow/level/power/weight — float32 нарийвчлал хүрнэ);
// totalizer/energy-д ХЭРЭГЛЭХГҮЙ.
struct LiveState { float last2 = NAN; bool flip = false; };
static float liveValue(float v, LiveState &st) {
  float v2 = roundf(v * 100.0f) / 100.0f;       // 2 орноор бөөрөнхийл
  st.flip = (v2 == st.last2) ? !st.flip : false; // гацвал сэлгэ, өөрчлөгдвөл 0
  st.last2 = v2;
  return v2 + (st.flip ? 0.001f : 0.0f);         // 3 дахь орны flag
}
LiveState lvFm1, lvFm2, lvFm3, lvLevel;

