quantummongolia/industrial-iot/esp32_firmware/flowmeter/src/main.cpp
// ========================== MODBUS READ WITH RETRY =========================
// Slave түр хариу өгөхгүй байгаа тохиолдлыг (intermittent failure)
// нэг удаагийн дахин оролдлогоор нөхнө. 9600 baud дээр нэг уншилт ~30ms тул
// дахин оролдлого + 50ms delay = ~80ms нэмж зарцуулна. Bus contention багатай
// үед энэ нь гол шалтгаан болж байгаа учир үр дүн өндөр.
bool readFloatRetry(uint8_t slave, uint16_t reg, float &out) {
  if (modbus.readFloat(slave, reg, out))
    return true;
  delay(cfg::MODBUS_RETRY_DELAY_MS);
  return modbus.readFloat(slave, reg, out);
}

bool readTotalizerRetry(uint8_t slave, uint16_t reg, float &out) {
  if (modbus.readTotalizer(slave, reg, out))
    return true;
  delay(cfg::MODBUS_RETRY_DELAY_MS);
  return modbus.readTotalizer(slave, reg, out);
}

bool readShortRetry(uint8_t slave, uint16_t reg, uint16_t &out) {
  if (modbus.readShort(slave, reg, out))
    return true;
  delay(cfg::MODBUS_RETRY_DELAY_MS);
  return modbus.readShort(slave, reg, out);
}

// ========================== MODBUS RECOVERY =========================

/*
 * Escalating recovery when Modbus reads fail repeatedly:
 *   Level 1: modbus.recover() (UART restart + DE/RE toggle) — most common fix
 *   Level 2: hardware reboot via watchdog (last resort)
 */
void recoverModbusBus() {
  totalRecoveryAttempts++;
  Serial.printf("[Recovery] Attempt #%u after %u failed cycles\n",
                totalRecoveryAttempts, consecutiveReadFails);

  if (totalRecoveryAttempts >= cfg::MAX_TOTAL_RECOVERY_FAILS) {
    // Цэвэр reboot — while(true)+WDT panic нь S3/USB-CDC дээр backtrace-аа
    // гацсан USB порт руу хэвлэхийг оролдоод reboot хүртэл хүрдэггүй (чип хөшинэ).
    // esp_restart() panic printer-ээр орохгүй тул заавал найдвартай сэргэнэ.
    Serial.println("[Recovery] Max attempts reached — clean ESP.restart()");
    Serial.flush();
    delay(100);
    ESP.restart();
  }

  modbus.recover();
  consecutiveReadFails = 0; // Give the bus a fresh chance
  Serial.println("[Recovery] RS485 bus re-initialized");
}

// ========================== SETUP (RUNS ONCE AT BOOT)
// ==================================

/*
 * Arduino setup function — runs once when ESP32 powers on or resets.
 * Initializes serial ports, RS485 transceiver, WiFi, Firebase, and watchdog
 * timer.
 */
// ── Task WDT timeout handler (cfg::WDT_TIMEOUT_S) ─────────────────────────────
// trigger_panic=false тул loop() нь хугацаандаа esp_task_wdt_reset() хийгээгүй үед
// TWDT нь panic үүсгэхгүйгээр энэ weak handler-ийг timer-ISR контекстэд дууддаг.
// Энд ШУУД esp_restart() хийнэ — panic/coredump/serial хэвлэлийн зам бүрэн алгасагдаж,
// "амьд атлаа хөшсөн" (Firebase/Modbus блоклосон, эсвэл panic handler гацсан) төлвөөс
// найдвартай гарна. Энэ нь гадны hardware watchdog-гүйгээр сэргэлтийн гол баталгаа.
extern "C" void esp_task_wdt_isr_user_handler(void) {
  esp_restart();
}

void setup() {
  Serial.begin(115200); // Initialize debug serial port at 115200 baud
  delay(300);           // Brief delay for USB-CDC serial to stabilize
  Serial.println("\n========= Flowmeter IoT (S3-Zero x3) =========");

  led::begin();
  // LED runs on its own core 0 task so Modbus / Firebase blocking calls
  // on core 1 (Arduino loop) never freeze the blink animation.
  xTaskCreatePinnedToCore(ledTask, "ledTask", 2048, nullptr, 1, nullptr, 0);

  // Modbus class дотор pinMode + digitalWrite + Serial1.begin бүгдийг хийнэ
  modbus.begin();
  Serial.printf(
      "[Modbus] Initialized — Flowmeter 1: Slave %d, Flowmeter 2: Slave %d, "
      "Flowmeter 3: Slave %d\n",
      cfg::FM1_SLAVE, cfg::FM2_SLAVE, cfg::FM3_SLAVE);

  WiFi.onEvent(onWifiEvent); // Register auto-reconnect event handler BEFORE
                             // first connect
  wifiConnect();             // Connect to WiFi network
  firebaseInit();            // Initialize Firebase connection

  // Configure ESP32 hardware watchdog timer to reset the chip if code hangs
  esp_task_wdt_config_t wdtConfig = {
      .timeout_ms = cfg::WDT_TIMEOUT_S * 1000, // Timeout in milliseconds
      .idle_core_mask = 0,                // Don't watch idle tasks
      // panic БИШ: timeout болоход esp_task_wdt_isr_user_handler()-ээс ШУУД
      // esp_restart() хийнэ. panic handler гацах (coredump/USB-CDC) эрсдэлийг тойрно.
      .trigger_panic = false};
  esp_task_wdt_reconfigure(&wdtConfig);   // Apply watchdog configuration
  esp_task_wdt_add(NULL); // Add current task to watchdog monitoring

  // Supervisor watchdog task — setup дууссаны дараа эхлүүлнэ (setup-ийн блоклох
  // wifiConnect зэргийг false-restart болгохгүйн тулд). Core 0.
  xTaskCreatePinnedToCore(watchdogTask, "wdog", 2048, nullptr, 1, nullptr, 0);
  Serial.printf("[WDT] Watchdog started — %d second timeout\n",
                cfg::WDT_TIMEOUT_S);
}

// ========================== MAIN LOOP (RUNS REPEATEDLY) =================

/*
 * Arduino loop function — runs continuously after setup().
 * Reads both flowmeters via Modbus RTU and uploads values to Firebase.
 * Includes WiFi reconnection logic and watchdog timer reset.
 */
void loop() {
  g_loopBeat++;           // supervisor task-д "loop ахиж байна" дохио
  esp_task_wdt_reset();
  unsigned long now = millis();

  // ---- Long-running stability watchdog ----
  // Heap fragmentation (Firebase TLS буфер, FirebaseJson allocation г.м.) удаан
  // ажиллах тусам хуримтлагдаж тогтворгүй болгож болзошгүй. 2 хамгаалалт:
  //   1) 5 минут тутам free heap-г log хийнэ — graphana/serial monitor дээр
  //      санах ой буурч буй эсэхийг харж болно.
  //   2) Free heap нь босгоос (20KB) доош унавал, эсвэл uptime 24 цаг хэтэрвэл
  //      cleaн restart хийж бүх ресурсыг чөлөөлнө. ESP.restart() нь
  //      крашгүй perezagruz хийдэг — Firebase, ota::loop хувилбаруудаас
  //      найдвартай. WiFi/Firebase setup() дээр дахин эхэлнэ.
  if (now - lastHeapLogTime >= cfg::HEAP_LOG_INTERVAL_MS) {
    lastHeapLogTime = now;
    Serial.printf("[Heap] Free: %u bytes | Min ever: %u | Uptime: %lus\n",
                  ESP.getFreeHeap(), ESP.getMinFreeHeap(), now / 1000);
  }
  if (ESP.getFreeHeap() < cfg::MIN_FREE_HEAP_BYTES) {
    Serial.printf("[Stability] Free heap %u < %u — restarting\n",
                  ESP.getFreeHeap(), cfg::MIN_FREE_HEAP_BYTES);
    delay(200);
    ESP.restart();
  }
  if (now >= cfg::MAX_UPTIME_MS) {
    Serial.println("[Stability] Reached 24h uptime — scheduled restart");
    delay(200);
    ESP.restart();
  }

  // ---- Connectivity watchdog ----
  // WiFi эсвэл Firebase нь cfg::MAX_OFFLINE_MS-ээс удаан салгагдвал цэвэр reboot.
  // Энэ нь сэргэлтийн гол баталгаа: WiFi буцаж ирэхэд эсвэл сенсор сэргэхэд
  // төхөөрөмж "бүр мөсөн алга" болохгүй, заавал өөрөө сэргэнэ. Firebase.ready()-г
  // энд цикл бүрт дуудах нь token-refresh-ийг тасралтгүй ажиллуулж бас тустай.
  if (WiFi.status() == WL_CONNECTED) {
    wifiDownSince = 0;
  } else if (wifiDownSince == 0) {
    wifiDownSince = now;
  } else if (now - wifiDownSince >= cfg::MAX_OFFLINE_MS) {
    Serial.println("[Watchdog] WiFi offline too long — clean restart");
    Serial.flush();
    delay(200);
    ESP.restart();
  }

  if (WiFi.status() == WL_CONNECTED && !Firebase.ready()) {
    if (fbNotReadySince == 0) {
      fbNotReadySince = now;
    } else if (now - fbNotReadySince >= cfg::MAX_OFFLINE_MS) {
      Serial.println("[Watchdog] Firebase not ready too long — clean restart");
      Serial.flush();
      delay(200);
      ESP.restart();
    }
  } else {
    fbNotReadySince = 0;
  }

